---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionCannotReplaceRefs
source: html/2a11ba00-81ee-ec47-4bed-d56f609b3a71.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionCannotReplaceRefs Property

Structural Connection cannot replace elements

## Syntax (C#)
```csharp
public static FailureDefinitionId StructuralConnectionCannotReplaceRefs { get; }
```